Revit 2027 API
CriticalPathIterator.IsDone Method
 Identifies if the iteration has completed.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool IsDone()
Public Overridable Function IsDone As Boolean
public:
virtual bool IsDone()
abstract IsDone : unit -> bool
override IsDone : unit -> bool
Return Value
Boolean
 True if all segments have been visited on the critical path. False if there are more segments to be visited.
See Also
Reference
CriticalPathIterator Class
Autodesk.Revit.DB.Analysis Namespace